<script setup lang="ts">
import BTitle from "@c/common/b-title/b-title.vue"
import PortalAccordion from "@c/portal/portal-accordion/portal-accordion.vue"
import PortalAccordionPanel from "@c/portal/portal-accordion/portal-accordion-panel.vue"
import PortalAccordionHeader from "@c/portal/portal-accordion/portal-accordion-header.vue"
import PortalAccordionContent from "@c/portal/portal-accordion/portal-accordion-content.vue"
</script>

<template>
    <div class="mango-audit-view">
        <b-title
            title="Бальная система по манго-аудиту"
            variant="xl"
            class="mb-x2"
        />

        <div class="grid">
            <div class="col-8">
                <portal-accordion multiple>
                    <portal-accordion-panel value="0">
                        <portal-accordion-header>
                            Эмоциональное состояние админа во время приветствия и разговора по телефону, поддержание диалога
                        </portal-accordion-header>
                        <portal-accordion-content>
                            <div class="content">
                                <ul>
                                    <li>Безэмоциональное/сонное/приветствие и общение- 2 балла</li>
                                    <li>Безэмоциональное/пассивное/не энергичное общение - 1 балл</li>
                                    <li>Администратор не поддерживает диалог на постоянной основе - 1 балл</li>
                                </ul>
                            </div>
                        </portal-accordion-content>
                    </portal-accordion-panel>

                    <portal-accordion-panel value="1">
                        <portal-accordion-header>
                            Правильность приветствия админа (назвал свое имя, филиал и поприветствовал гостя)
                        </portal-accordion-header>
                        <portal-accordion-content>
                            <div class="content">
                                <ul>
                                    <li>Отсутствует имя, филиал в большинстве записях или админ говорит "слушаю Вас", вместо того, чтобы поздороваться - 2 балла</li>
                                    <li>Отсутствует имя, филиал в одной записи - 1 балл</li>
                                </ul>
                            </div>
                        </portal-accordion-content>
                    </portal-accordion-panel>

                    <portal-accordion-panel value="2">
                        <portal-accordion-header>
                            Умение правильно донести условия акций/стоимость услуг/описания самих услуг.
                        </portal-accordion-header>
                        <portal-accordion-content>
                            <div class="content">
                                <ul>
                                    <li>Админ не знает цены, очень долго их ищет, либо долго считает общую стоимость (от 20 сек) - 1 балл</li>
                                    <li>Админ не правильно проговаривает акции - 1 балл</li>
                                    <li>Админ не правильно описывает услуги, либо очень коротко рассказывает о них - 1 балл</li>
                                    <li>Если гость спросил стоимость услуги и админ назвал полную стоимость стрижки, не проговорив сплит акции "счастливые часы" (В первую очередь мы стараемся называть самую низкую стоимость стрижки, чтобы привлечь или удержать гостя) - 2 балла</li>
                                </ul>
                            </div>
                        </portal-accordion-content>
                    </portal-accordion-panel>

                    <portal-accordion-panel value="3">
                        <portal-accordion-header>
                            Время ожидания клиента во время звонка, процесс записи (админ отошел, админ тупит, админ медленно работает)
                        </portal-accordion-header>
                        <portal-accordion-content>
                            <div class="content">
                                <ul>
                                    <li>Админ долго записывает/смотрит свободные окна (от 15 сек) - 1 балл</li>
                                    <li>Админ не выключил микрофон, когда отошел - 2 балла</li>
                                    <li>Пассивная работа с гостем (админ не предложил записаться в другой день, другого мастера, не попытался удержать гостя с помощью акций и скидок. Пример: первое посещение, скидка для студентов, счастливые часы) - 1 балл</li>
                                    <li>Админ во время звонка пошел рассчитывать другого гостя и попросил человека на трубке подождать - 1 балл</li>
                                    <li>Админ взял трубку и сказал гостю, что перезвонит через 5 минут - 2 балла</li>
                                </ul>
                            </div>
                        </portal-accordion-content>
                    </portal-accordion-panel>

                    <portal-accordion-panel value="4">
                        <portal-accordion-header>
                            Проговорить основные детали записи в конце разговора (к какому мастеру записал, на какие услуги, время)
                        </portal-accordion-header>
                        <portal-accordion-content>
                            <div class="content">
                                <ul>
                                    <li>Админ неполноценно дублирует детали записи в конце разговора - 1 балл</li>
                                </ul>
                            </div>
                        </portal-accordion-content>
                    </portal-accordion-panel>

                    <portal-accordion-panel value="5">
                        <portal-accordion-header>
                            Этикет общения (общение на «вы», слова паразиты не используются, грамотная русская речь)
                        </portal-accordion-header>
                        <portal-accordion-content>
                            <div class="content">
                                <ul>
                                    <li>Админ переходит на "ты" во время общения по телефону - 2 балла</li>
                                    <li>Частое использование слов паразитов - 1 балл</li>
                                    <li>Неуважительное общение с гостем, грубые ответы, повышение голоса - 5 баллов вычитается сразу, и штраф 5000₽.</li>
                                </ul>
                            </div>
                        </portal-accordion-content>
                    </portal-accordion-panel>

                    <portal-accordion-panel value="6">
                        <portal-accordion-header>
                            Запись на 21:30 (админ отказывает клиенту при записи на 21:30)
                        </portal-accordion-header>
                        <portal-accordion-content>
                            <div class="content">
                                <ul>
                                    <li>Отказ в записи в 21:30 (если администратор категорически отказывает, по причине того, что барбершоп скоро закрывается - это будет считаться грубой ошибкой) - 2 балла.</li>
                                </ul>
                            </div>
                        </portal-accordion-content>
                    </portal-accordion-panel>

                    <portal-accordion-panel value="7">
                        <portal-accordion-header>
                            Предложение дополнительных услуг (воск, уходовые процедуры)
                        </portal-accordion-header>
                        <portal-accordion-content>
                            <div class="content">
                                <ul>
                                    <li>не штрафуем</li>
                                </ul>
                            </div>
                        </portal-accordion-content>
                    </portal-accordion-panel>

                    <portal-accordion-panel value="8">
                        <portal-accordion-header>
                            Предпочтение по мастерам
                        </portal-accordion-header>
                        <portal-accordion-content>
                            <div class="content">
                                <ul>
                                    <li>не штрафуем</li>
                                </ul>
                            </div>
                        </portal-accordion-content>
                    </portal-accordion-panel>
                </portal-accordion>

                <div class="content mt-x2">
                    <p>В случае набора филиалом от 5 и более баллов, штрафные санкции применяются после повторной проверки. На исправление ошибок даётся 14 календарных дней.</p>
                    <p class="mb-x0">Отчеты по манго аудированию высылает Екатерина (+79067019944)</p>
                    <p>За остальными разборами Вы так же можете обращаться к ней.</p>
                </div>
            </div>

            <div class="col-4">
                <!-- TODO: блок под изображение -->
            </div>
        </div>

        <!--
        <portal-card>
            <div class="content">
                ЗА КАЖДЫЙ НЕДОЧЁТ СНИМАЕТСЯ ОПРЕДЕЛЁННЫЙ БАЛЛ.

                <ol>


                    <li>Правильность приветствия админа (назвал свое имя, филиал и поприветствовал гостя)
                        <ul>
                            <li>Отсутствует имя, филиал в большинстве записях или админ говорит "слушаю Вас", вместо того, чтобы поздороваться - 2 балла</li>
                            <li>Отсутствует имя, филиал в одной записи - 1 балл</li>
                        </ul>
                    </li>
                </ol>
                2. Правильность приветствия админа (назвал свое имя, филиал и поприветствовал гостя)

                • Отсутствует имя, филиал в большинстве записях или админ говорит "слушаю Вас", вместо того, чтобы поздороваться - 2 балла
                • Отсутствует имя, филиал в одной записи - 1 балл

                3. Умение правильно донести условия акций/стоимость услуг/описания самих услуг.

                • Админ не знает цены, очень долго их ищет, либо долго считает общую стоимость (от 20 сек) - 1 балл
                • Админ не правильно проговаривает акции - 1 балл
                • Админ не правильно описывает услуги, либо очень коротко рассказывает о них - 1 балл
                • Если гость спросил стоимость услуги и админ назвал полную стоимость стрижки, не проговорив сплит акции "счастливые часы" (В первую очередь мы стараемся называть самую низкую стоимость стрижки, чтобы привлечь или удержать гостя) - 2 балла

                4. Время ожидания клиента во время звонка, процесс записи (админ отошел, админ тупит, админ медленно работает)

                • Админ долго записывает/смотрит свободные окна (от 15 сек) - 1 балл
                • Админ не выключил микрофон, когда отошел - 2 балла
                • Пассивная работа с гостем (админ не предложил записаться в другой день, другого мастера, не попытался удержать гостя с помощью акций и скидок. Пример: первое посещение, скидка для студентов, счастливые часы) - 1 балл
                • Админ во время звонка пошел рассчитывать другого гостя и попросил человека на трубке подождать - 1 балл
                • Админ взял трубку и сказал гостю, что перезвонит через 5 минут - 2 балла

                5. Проговорить основные детали записи в конце разговора (к какому мастеру записал, на какие услуги, время)

                • Админ неполноценно дублирует детали записи в конце разговора - 1 балл

                6. Этикет общения (общение на «вы», слова паразиты не используются, грамотная русская речь)

                • Админ переходит на "ты" во время общения по телефону - 2 балла
                • Частое использование слов паразитов - 1 балл
                • Неуважительное общение с гостем, грубые ответы, повышение голоса - 5 баллов вычитается сразу, и штраф 5000₽.

                7. Запись на 21:30 (админ отказывает клиенту при записи на 21:30)

                • Отказ в записи в 21:30 (если администратор категорически отказывает, по причине того, что барбершоп скоро закрывается - это будет считаться грубой ошибкой) - 2 балла.

                8. Предложение дополнительных услуг (воск, уходовые процедуры) - не штрафуем

                9. Предпочтение по мастерам (не штрафуем)

                В случае набора филиалом от 5 и более баллов, штрафные санкции применяются после повторной проверки. На исправление ошибок даётся 14 календарных дней.

                Отчеты по манго аудированию высылает Екатерина (+79067019944)
                За остальными разборами Вы так же можете обращаться к ней.
            </div>
        </portal-card>
        -->
    </div>
</template>

<style lang="scss" scoped>
.mango-audit-view {
    .content {
        @include text-content;
    }
}
</style>
