<script setup lang="ts">
import BDivider from "@c/common/b-divider/b-divider.vue"
import BImage from "@c/common/b-image/b-image.vue"
import BLink from "@c/common/b-link/b-link.vue"
import BBlockquote from "@c/common/b-blockquote/b-blockquote.vue"
import PortalPage from "@c/portal/portal-page/portal-page.vue"
import PortalCard from "@c/portal/portal-card/portal-card.vue"
</script>

<template>
    <portal-page
        class="ip-telephony-troubleshoot-view"
        title="Что делать, если IP-телефония не работает"
    >
						
            <portal-card>
                <div class="content">
                    <p>
                        Данная инструкция подходит для телефонных трубок Gigaset и Panasonic, которые используются в наших филиалах.
                    </p>
                    <p>
                        Если телефон не принимает или не совершает звонки, выполните шаги ниже строго по порядку.
                    </p>

                </div>
            </portal-card>
			
			<portal-card>
                <div class="content">
                    <b-image
					src="instructions/ip-telephony-base.png"
					full
					/>
                </div>
            </portal-card>
			
			<portal-card title="1. Проверка индикации на базовом блоке">
                <div class="content">
                    <p>
						Убедитесь, что световой индикатор на базе горит любым цветом (зелёный / красный / жёлтый / синий):
					</p>

                    <ul>
						<li>Индикатор не горит — переходите к пункту 2.</li>
						<li>Индикатор горит красным — отсутствует подключение. Переходите к пункту 3.</li>
						<li>Индикатор горит зелёным — телефония должна работать, соединение с сервером установлено.
							<p>Если при этом звонки не проходят:</p>
							<ul>
								<li>выключите базу из розетки минимум на 10 секунд и включите обратно;</li>
								<li>перезагрузите телефонную трубку.</li>
							</ul>
						</li>
					</ul>

                    <p>
                        ⚠️ Важно: ни в коем случае не нажимайте кнопку RESET — это приведёт к сбросу настроек и потребует платной перенастройки.
                    </p>
                </div>
            </portal-card>


            <portal-card title="2. Проверка питания">
				<div class="content">
					<p>
						Убедитесь, что базовый блок корректно подключена к электросети:
					</p>

					<ul>
						<li>блок питания плотно вставлен в розетку;</li>
						<li>розетка исправна;</li>
						<li>не используется удлинитель с выключенной кнопкой.</li>
					</ul>

					<p>
						Рекомендуется отключить питание базы на 5–10 секунд и включить обратно.
					</p>

					<p>
						Если это не помогло:
					</p>

					<ul>
						<li>попробуйте другую розетку;</li>
						<li>при возможности — другой блок питания с аналогичным вольтажом и типом разъёма.</li>
					</ul>
				</div>
			</portal-card>


            <portal-card title="3. Проверка работы интернета">
				<div class="content">
					<p>
						Проверьте работу интернета на филиале:
					</p>

					<ul>
						<li>открываются ли сайты на компьютере администратора;</li>
						<li>работает ли Wi-Fi и подключены ли вы к своей точке доступа, а не к соседней;</li>
						<li>проверьте LAN-кабель:
							<ul>
								<li>один конец подключён к базе телефона;</li>
								<li>второй — в LAN-порт роутера.</li>
							</ul>
						</li>
						<li>кабель от базы телефона нельзя подключать в WAN-порт роутера.</li>
					</ul>

					<p>
						Если интернет нестабилен или отсутствует — проблема не в телефоне.
					</p>

					<p>
						Перезагрузите роутер и дождитесь полного восстановления связи (2–3 минуты).
						При возможности попробуйте другой LAN-порт или временно замените кабель.
					</p>
				</div>
			</portal-card>

			
			<portal-card title="4. Проверка трубки">
				<div class="content">
					<p>
						Проверьте состояние телефонной трубки:
					</p>

					<ul>
						<li>экран должен включаться;</li>
						<li>не должно отображаться сообщений:
							<ul>
								<li>«Нет базы»</li>
								<li>«Поиск базы»</li>
								<li>«Not registered»</li>
							</ul>
						</li>
					</ul>

					<p>
						Поставьте трубку на зарядку и подождите 30–60 секунд для повторной регистрации.
					</p>

					<p>
						Если на экране отображаются ошибки 001, 002, 003 и т. п. — вернитесь к пункту 3.
					</p>
				</div>
			</portal-card>

			
			<portal-card title="5. Аккумуляторы">
				<div class="content">
					<p>
						В телефонных трубках используются только перезаряжаемые аккумуляторы.
					</p>

					<ul>
						<li>обычные батарейки использовать нельзя;</li>
						<li>если трубка быстро разряжается или выключается — замените аккумуляторы.</li>
						<li>ищите на маркетплейсах по запросу "aaa gp 650 rechargeable"</li>
					</ul>

					<p>
						После замены поставьте трубку на зарядку и подождите 30–60 секунд. Для включения телефонной трубки зажмите красную кнопку.
					</p>
				</div>
			</portal-card>

			
			<portal-card title="6. Когда и куда обращаться за помощью">
				<div class="content">
					<p>
						Если интернет работает, индикация в норме, но звонки по-прежнему не проходят —
						обратитесь к <b-link label="Диме Крымцеву" href="http://wa.me/79994845317"/>.
					</p>

					<p>
						В сообщении обязательно укажите:
					</p>

					<ul>
						<li>модель телефона;</li>
						<li>какая ошибка отображается (если есть);</li>
						<li>какие пункты инструкции уже были выполнены.</li>
					</ul>

					<p>
						По нашему опыту, телефония редко выходит из строя сама по себе.
						Чаще всего либо возникает общая проблема (её можно уточнить в чате партнёров),
						либо причина локальная — интернет, оборудование на филиале или недавние изменения в настройках.
						В таких случаях требуется дополнительная проверка и разбор на месте.
					</p>
				</div>
			</portal-card>

    </portal-page>
</template>

<style lang="scss" scoped>
.ip-telephony-troubleshoot-view {
    .content {
        @include text-content;
    }
}
</style>
