<script setup lang="ts">
import BImage from "@c/common/b-image/b-image.vue"
import BLink from "@c/common/b-link/b-link.vue"
import BBlockquote from "@c/common/b-blockquote/b-blockquote.vue"
import PortalPage from "@c/portal/portal-page/portal-page.vue"
import PortalCard from "@c/portal/portal-card/portal-card.vue"
</script>

<template>
    <portal-page
        class="ip-telephony-troubleshoot-view"
        title="Что делать, если IP-телефония не работает"
    >

            <portal-card>
                <div class="content">
                    <p>
                        Данная инструкция подходит для телефонных трубок Gigaset и Panasonic, которые используются в наших филиалах.
                    </p>
                    <p>
                        Если телефон не принимает или не совершает звонки, выполните шаги ниже строго по порядку.
                    </p>

                </div>
            </portal-card>

			<portal-card>
                <div class="content">
                    <b-image
					src="instructions/ip-telephony-base.png"
					full
					/>
                </div>
            </portal-card>

			<portal-card title="1. Проверка индикации на базовом блоке">
                <div class="content">
                    <p>
						Убедитесь, что световой индикатор на базе горит любым цветом (зелёный / красный / жёлтый / синий):
					</p>

                    <ul>
						<li>Индикатор не горит — переходите к пункту 2.</li>
						<li>Индикатор горит красным — отсутствует подключение. Переходите к пункту 3.</li>
						<li>Индикатор горит зелёным — телефония должна работать, соединение с сервером установлено.
							<p>Если при этом звонки не проходят:</p>
							<ul>
								<li>выключите базу из розетки минимум на 10 секунд и включите обратно;</li>
								<li>перезагрузите телефонную трубку.</li>
							</ul>
						</li>
					</ul>

                    <p>
                        ⚠️ Важно: ни в коем случае не нажимайте кнопку RESET — это приведёт к сбросу настроек и потребует платной перенастройки.
                    </p>
                </div>
            </portal-card>


            <portal-card title="2. Проверка питания">
				<div class="content">
					<p>
						Убедитесь, что базовый блок корректно подключена к электросети:
					</p>

					<ul>
						<li>блок питания плотно вставлен в розетку;</li>
						<li>розетка исправна;</li>
						<li>не используется удлинитель с выключенной кнопкой.</li>
					</ul>

					<p>
						Рекомендуется отключить питание базы на 5–10 секунд и включить обратно.
					</p>

					<p>
						Если это не помогло:
					</p>

					<ul>
						<li>попробуйте другую розетку;</li>
						<li>при возможности — другой блок питания с аналогичным вольтажом и типом разъёма.</li>
					</ul>
				</div>
			</portal-card>


            <portal-card title="3. Проверка работы интернета">
				<div class="content">
					<p>
						Проверьте работу интернета на филиале:
					</p>

					<ul>
						<li>открываются ли сайты на компьютере администратора;</li>
						<li>работает ли Wi-Fi и подключены ли вы к своей точке доступа, а не к соседней;</li>
						<li>проверьте LAN-кабель:
							<ul>
								<li>один конец подключён к базе телефона;</li>
								<li>второй — в LAN-порт роутера.</li>
							</ul>
						</li>
						<li>кабель от базы телефона нельзя подключать в WAN-порт роутера.</li>
					</ul>

					<p>
						Если интернет нестабилен или отсутствует — проблема не в телефоне.
					</p>

					<p>
						Перезагрузите роутер и дождитесь полного восстановления связи (2–3 минуты).
						При возможности попробуйте другой LAN-порт или временно замените кабель.
					</p>
				</div>
			</portal-card>


			<portal-card title="4. Проверка трубки">
				<div class="content">
					<p>
						Проверьте состояние телефонной трубки:
					</p>

					<ul>
						<li>экран должен включаться;</li>
						<li>не должно отображаться сообщений:
							<ul>
								<li>«Нет базы»</li>
								<li>«Поиск базы»</li>
								<li>«Not registered»</li>
							</ul>
						</li>
					</ul>

					<p>
						Поставьте трубку на зарядку и подождите 30–60 секунд для повторной регистрации.
					</p>

					<p>
						Если на экране отображаются ошибки 001, 002, 003 и т. п. — вернитесь к пункту 3.
					</p>
				</div>
			</portal-card>


			<portal-card title="5. Аккумуляторы">
				<div class="content">
					<p>
						В телефонных трубках используются только перезаряжаемые аккумуляторы.
					</p>

					<ul>
						<li>обычные батарейки использовать нельзя;</li>
						<li>если трубка быстро разряжается или выключается — замените аккумуляторы.</li>
						<li>ищите на маркетплейсах по запросу "aaa gp 650 rechargeable"</li>
					</ul>

					<p>
						После замены поставьте трубку на зарядку и подождите 30–60 секунд. Для включения телефонной трубки зажмите красную кнопку.
					</p>
				</div>
			</portal-card>


			<portal-card title="6. Когда и куда обращаться за помощью">
				<div class="content">
					<p>
						Если интернет работает, индикация в норме, но звонки по-прежнему не проходят —
						обратитесь к <b-link label="Диме Крымцеву" href="https://wa.me/79994845317"/>.
					</p>

					<p>
						В сообщении обязательно укажите:
					</p>

					<ul>
						<li>модель телефона;</li>
						<li>какая ошибка отображается (если есть);</li>
						<li>какие пункты инструкции уже были выполнены.</li>
					</ul>

					<p>
						По нашему опыту, телефония редко выходит из строя сама по себе.
						Чаще всего либо возникает общая проблема (её можно уточнить в чате партнёров),
						либо причина локальная — интернет, оборудование на филиале или недавние изменения в настройках.
						В таких случаях требуется дополнительная проверка и разбор на месте.
					</p>
				</div>
			</portal-card>
			
			// Поиск сотрудников на замену
			
			<portal-card title="Поиск сотрудников на замену">
				<div class="content">
					<p>
						BRITVA SEARCH — внутренний сервис помощи в поиске сотрудников для филиалов сети. Его задача — обеспечить бесперебойную работу филиалов за счёт оперативного закрытия смен, когда у постоянных администраторов возникают форс-мажоры или свободные окна в графике. 
					</p>

					<p>
						Сервис работает по принципу взаимопомощи: администраторы, готовые выйти дополнительно, объединяются в единую группу. Так филиалы не остаются без сотрудников, а администраторы получают шанс увеличить занятость и доход. 
					</p>

					<p>
						Все процессы — от подачи заявки до выхода на смену — регулируются регламентом ниже. Он описывает порядок взаимодействия, обязанности сторон и меры ответственности. 
					</p>
					
					<b-link label="Перейти в канал" href="https://t.me/britva_search"/>.
					
				</div>
			</portal-card>
			
			<portal-card title="Координаторы группы">
				<div class="content">
					<ul>
						<li>Смелянский Владислав — +7 (985) 795-55-25</li>
						<li>Вискушенко Георгий — +7 (977) 489-58-99</li>
					</ul>
				</div>
			</portal-card>
			
			<portal-card title="1. Общие положения">
				<div class="content">
					<p>
						1.1. Настоящий регламент определяет порядок работы группы подменных администраторов, созданной для оперативного закрытия вакантных смен в графиках постоянных администраторов филиалов сети. 	
					</p>
					<p>
						1.2. В группу включаются администраторы, которые:
						<ul>
							<li>имеют недостаточное количество основных смен в своём филиале</li>
							<li>изъявили добровольное желание участвовать в подменах</li>	
							<li>знакомы и согласны с условиями настоящего регламента</li>
						</ul>
					</p>
					<p>
						1.3. Координацию работы группы осуществляют ответственные лица (контакты выше).
					</p>
				</div>
			</portal-card>
			
			<portal-card title="2. Порядок поиска и назначения подменного администратора">
				<div class="content">
					<p>
						2.1. При возникновении потребности в закрытии смены ответственный сотрудник проблемного филиала обращается к Координаторам.	
					</p>
					<p>
						2.2. Координаторы размещают объявление о вакантной смене в группу.
					</p>
					<p>
						2.3. Администратор, желающий занять вакантную смену, проверяет соответствие условиям:
						<ul>
							<li>отсутствие собственной смены в день подмены</li>
							<li>предварительное устное согласование выхода с владельцем или управляющим своего филиала</li>	
							<li>готовность прибыть вовремя и выполнить все обязанности в полном объёме</li>
						</ul>						
					</p>
					<p>
						2.4. После подтверждения администратор сообщает о готовности координатору или в группу.
					</p>
					<p>
						2.5. Окончательное подтверждение выхода — только после согласования с ответственным лицом принимающего филиала.
					</p>
				</div>
			</portal-card>
			
			
			<portal-card title="3. Обязанности подменного администратора">
				<div class="content">
					<ul>
						<li>своевременно прибыть на рабочее место</li>
						<li>выполнять обязанности по действующей должностной инструкции</li>	
						<li>соблюдать внутренние правила и стандарты принимающего филиала</li>
						<li>передать необходимую информацию по итогам смены ответственному лицу</li>
					</ul>			
				</div>
			</portal-card>
			
			
			<portal-card title="4. Обязанности принимающего филиала">
				<div class="content">
					<ul>
						<p><b>Информационное обеспечение:</b> предоставить график работы, контакты ответственных лиц, информацию о совместном открытии/закрытии (при необходимости), особенности филиала.</p>
						<p><b>Расчёт:</b> выплатить заработную плату за смену в день работы (либо в сроки, установленные ТК РФ, но не позднее даты основной выплаты в филиале).</p>	
						<p><b>Обратная связь:</b> заполнить форму — <b-link label="ссылка на форму." href="https://forms.yandex.ru/cloud/68bff1a984227c1371ca3954"/>.</p>
						<p><b>Соблюдение правил найма:</b> запрещён прямой хантинг сотрудников других филиалов без согласования с Координаторами и руководством (кроме сотрудников без постоянного филиала).</p>
					</ul>			
				</div>
			</portal-card>
			
			<portal-card title="5. Санкции за нарушение регламента	">
				<div class="content">
					<p>
						Для подменного администратора:
					</p>
					<ul>
						<li>неявка без уважительной причины и предупреждения — дисциплинарное взыскание</li>
						<li>повторная неявка в течение 3 месяцев — исключение из группы на 6 месяцев.</li>	
					</ul>
					<p>
						Для филиала:
					</p>
					<ul>
						<li>подтверждённый факт переманивания в обход правил — штраф 50 000 ₽.</li>
					</ul>			
				</div>
			</portal-card>
			
			// Внеплановый разбор филиала
			
			<portal-card title="Внеплановый разбор филиала">
				<div class="content">
				
					<b-image src="employees/grechishnikov.jpg" />	
				
					<b-image src="employees/filippov.jpg" />
					
					<ul>
						<li>Длительность — до 4 часов</li>
						<li>Стоимость — 10 000 рублей</li>
						<li>Присутствие владельца обязательно.</li>
					</ul>

					<p>
						Что входит в разбор:
					</p>
					<ul>
						<li>Аудит с указанием ошибок и предложения по решению выявленных проблем и нарушений;</li>
						<li>Разбор общих показателей филиала и каждого сотрудника индивидуально;</li>
						<li>Поиск точек роста оборота филиала и клиентского сервиса;</li>
						<li>Проверка продуктивности ведения yclients;</li>
						<li>Проверка информации филиала в геосервисах;</li>
						<li>Проработка с командой требований и рекомендаций сети;</li>
						<li>Разъяснение стандартов сети «из первых уст»;</li>
						<li>Диалог с командой — ответы на все интересующие сотрудников вопросы.</li>
					</ul>
				</div>
		  </portal-card>
    </portal-page>
</template>

<style lang="scss" scoped>
.ip-telephony-troubleshoot-view {
    .content {
        @include text-content;
    }
}
</style>
