<script setup lang="ts">
import PortalCard from "@c/portal/portal-card/portal-card.vue"
</script>

<template>
    <portal-card title="Регламент для занесения в чёрный список">
        <div class="content">
            <p>
                Чёрный список создан для того, чтобы обезопасить наших партнёров от сомнительных кадров,
                которые могут навредить репутации бренда, филиалу, коллективу, клиентам и владельцу.
            </p>
            <p>Cрок рассмотрения заявки 10 рабочих дней.</p>
        </div>
    </portal-card>

    <portal-card title="В чёрный список можно занести сотрудника по причинам:">
        <div class="content">
            <ol>
                <li>
                    Нахождение на рабочем месте в состоянии алкогольного или наркотического
                    опьянения (с предоставлением доказательства систематических нарушений).
                </li>
                <li>
                    Прямой умышленный саботаж коллектива (Пример: сотрудник пытается перейти в другой
                    салон и призывает команду идти за ним)
                </li>
                <li>Намеренный сбор клиентской базы, хищение/продажа.</li>
                <li>Махинация с финансами и финансовыми операциями.</li>
                <li>Махинации и сговор сотрудников барбершопа против интересов работодателя.</li>
                <li>Хищение имущества у владельца или коллектива.</li>
                <li>Разглашение конфиденциальной информации и интеллектуальной собственности бренда.</li>
                <li>Присвоение денежных средств клиентов.</li>
                <li>Искажение отчетной информации.</li>
                <li>Целенаправленное нанесение материального ущерба работодателю.</li>
                <li>Параллельная работа в конкурирующем салоне.</li>
            </ol>
        </div>
    </portal-card>

    <portal-card title="При наличии личностной неприязни со стороны владельца, руководителя либо коллектива по отношению к сотруднику внесение его в чёрный список запрещено.">
        <div class="content">
            <ol>
                <li>
                    Занесение в чёрный список происходит после одобрения ЦО! В случае сложных,
                    спорных ситуаций, не соответствующих пр авилам выше сотрудник и владелец/руководитель
                    филиала вызываются в ЦО.
                </li>
                <li>
                    Заявка на чёрный список рассматривается с приложением доказательств
                    в виде скриншотов/видеофиксации/фотофиксации.
                </li>
                <li>Без доказательств заявка не рассматривается.</li>
                <li>Срок рассмотрения заявки 14 рабочих дней.</li>
                <li>В заявке обязательно указываем номер телефона, имя и фамилию сотрудника.</li>
            </ol>
        </div>
    </portal-card>
</template>
