/**
 * Ключи используются для переводов шаблонов.
 */
export const TRANSLATIONS = {
    name: "Имя",
    phone: "Телефон",
    website: "Ссылка на сайт",
    registration: "Ссылка на онлайн-запись",
    yandexMap: "Ссылка на Яндекс. Карты",
    twoGisMap: "Ссылка на 2ГИС",
    instagram: "Ссылка на инстаграм",
    format: "Формат",
    promotion: "Условия акции",
    message: "Дополнительный коментарий",
    files: "Добавить доказательства виновности сотрудника (скриншоты, фото, видео и др.)"
}

export const TICKET_TITLE = "Заявка на макет"
