import type { CentralOfficeUser } from "@v/portal/_britva/contacts/central-office/defenitions/central-office"
import { ContentType } from "@/shared/content/content"

export const centralOfficeData: CentralOfficeUser[] = [
    {
        name: "Дмитрий Кормильцев",
        description: "генеральный директор сети, часы работы: пн-пт c 11:00 до 22:00",
        content: [
            "решение конфликтных и неоднозначных ситуаций с ЦО"
        ],
        contentType: ContentType.Bulleted,
        telnum: "79151253330"
    },
    {
        name: "Валерий Безлюдный",
        description: "исполнительный директор сети, часы работы: пн-пт c 10:00 до 20:00",
        content: [
            "организация и контроль работы сотрудников ЦО",
            "консультация по работе с командой"
        ],
        contentType: ContentType.Bulleted,
        telnum: "79686740219"
    },
    {
        name: "Екатерина Лушникова",
        description: "отдел маркетинга сети, часы работы: пн-пт с 10:00 до 20:00",
        content: [
            "введение франчайзи в процесс работы бренда: маркетинг, работа с макетами, визуал, карты",
            "разработка визуальных концепций",
            "маркетинговые кампании digital и офф-лайн: директ, таргетинг, кросс-промо, другие инструменты продвижения",
            "PR: работа с репутацией, позиционирование бренда и создание позитивного образа бренда",
            "руководство командой отдела продвижения: подрядчики, айти, менеджеры, дизайнеры и тд.",
            "контроль конструирования и ведения сайта sodanails.ru",
            "просмотр и проверка визуальных материалов и текстов"
        ],
        contentType: ContentType.Bulleted,
        telnum: "79833130820"
    },
    {
        name: "Александр Рыбочкин",
        description: "руководитель отдела сопровождения франшизы, часы работы: пн-пт с 10:00 до 20:00",
        content: [
            "аудирование филиалов, выявление проблем и поиск решений (в том числе штрафы по регламенту за несоответствие стандартов сети)",
            "коммуникация франшизы и центрального офиса",
            "решение негативных сложных моментов с клиентами",
            "помощь в развитии и поддержка франшизных филиалов",
            "стандартизация работы",
            "разбор заявок на топ-барберов и бренд-барберов",
            "работа с командой"
        ],
        contentType: ContentType.Bulleted,
        telnum: "79057106040"
    },
    {
        name: "Кирилл Кузнецов",
        description: "отдел сопровождения франшизы, часы работы: пн-пт с 10:00 до 20:00",
        content: [
            "визиты в филиалы (разборы/аудирование)",
            "помощь франчайзи по всей административной части",
            "курирование стажировок администраторов во франшизу",
            "коммуникация франшизы с центральным офисом",
            "стандартизация франчайзи"
        ],
        contentType: ContentType.Bulleted,
        telnum: "79962052321"
    },
    {
        name: "Глеб Гречишников",
        description: "отдел сопровождения франшизы, часы работы: пн-пт с 10:00 до 20:00",
        content: [
            "визиты в филиалы (разборы/аудирование)",
            "помощь франчайзи по всей административной части",
            "курирование стажировок администраторов во франшизу",
            "коммуникация франшизы с центральным офисом",
            "стандартизация франчайзи"
        ],
        contentType: ContentType.Bulleted,
        telnum: "79660698889"
    },
    {
        name: "Владислав Филиппов",
        description: "отдел сопровождения франшизы, часы работы: пн-пт с 10:00 до 20:00",
        content: [
            "визиты в филиалы (разборы/аудирование)",
            "помощь франчайзи по всей административной части",
            "курирование стажировок администраторов во франшизу",
            "коммуникация франшизы с центральным офисом",
            "стандартизация франчайзи"
        ],
        contentType: ContentType.Bulleted,
        telnum: "79152303099"
    },
    {
        name: "Смелянский Владислав",
        description: "руководитель отдела администраторов сети BRITVA, часы работы: ПН-ПТ с 10:00 до 20:00",
        content: [
            "Поиск и привлечение новых сотрудников в сеть",
            "Усовершенствование обучающего материала",
            "Работа с Черным списком",
            "Создание комфортных условий для работы администраторов сети",
            "Координация и усовершенствование аттестации администраторов и контроль выполнения всеми филиалами",
            "Выезды в филиалы сети для проверки и прокачки администраторов (знание памятки, знание портала, знание акций и партнерских программ, знание как посмотреть телефоны других филиалов сети)",
            "Один раз в месяц онлайн МК на произвольную тему для админов и управляющих сети",
            "Контроль обучения администраторов во франшизе",
            "Защита интересов администраторов сети"
        ],
        contentType: ContentType.Bulleted,
        telnum: "79857955525"
    },
    {
        name: "Удовиченко Александр",
        description: "Старший мастер сети BRITVA, часы работы: ПН-ЧТ с 10:00 до 20:00",
        content: [
            "Распределение заявок на повышение в градации и контроль сдачи экзаменов",
            "Контроль проведения экзаменов",
            "Контроль проведения МК (отсмотр новых и корректировка старых)",
            "Тестирование новой косметики и услуг",
            "Работа с экспертами и Амбасадорами сети",
            "Анализ показателей сотрудников сети BRITVA",
            "По запросу проведение аттестации/экзаменов/обучений",
            "Индивидуальное согласование на повышение по градации",
            "Работа с сетевыми партнерами",
            "Консультация франчайзи в рамках проведения аттестации/экзаменов",
            "Консультация франчайзи в рамках введения новых услуг и косметики",
            "Консультация новых франчайзи в рамках HR",
            "Фильтрация добавления сотрудников в ЧС",
            "Администрирование обучающего портала",
            "Сопровождение открытия новых филиалов сети BRITVA"
        ],
        contentType: ContentType.Bulleted,
        telnum: "79153263958"
    },
    {
        name: "Дмитрий Крымцев",
        description: "часы работы: пн-пт с 10:00 до 20:00",
        content: [
            "коммуникация франшизы",
            "консультация по работе с партнерами Mango, Yclients",
            "поиск сертификатов",
            "работа сайта mybritva",
            "интернет-радио"
        ],
        contentType: ContentType.Bulleted,
        telnum: "79994845317"
    },
    {
        name: "Снежанна Рыбочкина",
        description: "офис-менеджер и помощник отдела продвижения, часы работы: пн-пт с 10:00 до 20:00",
        content: [
            "создание макетов для печатной продукции, работа с дизайнером",
            "подсчет роялти",
            "возврат денег за сертификаты ЦО"
        ],
        contentType: ContentType.Bulleted,
        telnum: "79850989299"
    },
    {
        name: "Кристина Крымцева",
        description: "удаленный сотрудник центрального офиса",
        content: [
            "подсчет расходов манго-телефонии",
            "возврат денег за сертификаты франшизы"
        ],
        contentType: ContentType.Bulleted,
        telnum: "79994845484"
    },
    {
        name: "Михаил Ларионов",
        description: "руководитель отдела развития франшизы, часы работы: пн-пт с 10:00 до 20:00",
        content: [
            "покупка франшизы",
            "реконструкция и ремонт филиалов",
            "подбор помещения",
            "3D визуализация"
        ],
        contentType: ContentType.Bulleted,
        telnum: "79671056520"
    },
    {
        name: "Евгения Червонящая",
        description: "отдел развития франшизы, часы работы: пн-пт с 10:00 до 20:00",
        content: [],
        contentType: ContentType.Bulleted,
        telnum: "79104478582"
    },
    {
        name: "Владимир Савчук",
        description: "отдел развития франшизы, часы работы: пн-пт с 10:00 до 20:00",
        content: [],
        contentType: ContentType.Bulleted,
        telnum: "79260625418"
    },
    {
        name: "Данила Капранов",
        description: "отдел развития франшизы, часы работы: пн-пт с 10:00 до 20:00",
        content: [],
        contentType: ContentType.Bulleted,
        telnum: "79152256080"
    },
    {
        name: " Вадим Шалыгин",
        description: "отдел развития франшизы, часы работы: пн-пт с 10:00 до 20:00",
        content: [],
        contentType: ContentType.Bulleted,
        telnum: "79198312811"
    },
    {
        name: "Евгений Хужин",
        description: "направление социальных сетей, часы работы: пн-пт с 10:00 до 20:00",
        content: [
            "Инстаграм и все, что с ним связано",
            "организация съемок",
            "подбор блогеров",
            "таргетированная реклама"
        ],
        contentType: ContentType.Bulleted,
        telnum: "79995830040"
    },
    {
        name: "Артем Осипов",
        description: "",
        content: [
            "наполнение контентом сайта",
            "проблемы с Интернет-сертификатами проданные с сайта",
            "SEO, ключевые слова"
        ],
        contentType: ContentType.Bulleted,
        telnum: "79652914902"
    }
].map((item, index) => ({
    id: index + 1,
    ...item,
}))
