<script setup lang="ts">
import PortalPage from "@c/portal/portal-page/portal-page.vue"
import PortalCard from "@c/portal/portal-card/portal-card.vue"
import BLink from "@c/common/b-link/b-link.vue"
</script>

<template>
    <portal-page
        class="search-staff-view"
        title="Поиск сотрудников на замену"
    >
        <portal-card title="Поиск сотрудников на замену">
            <div class="content">
                <p>
                    BRITVA SEARCH — внутренний сервис помощи в поиске сотрудников для филиалов сети.
                    Его задача — обеспечить бесперебойную работу филиалов за счёт оперативного закрытия смен,
                    когда у постоянных администраторов возникают форс-мажоры или свободные окна в графике.
                </p>

                <p>
                    Сервис работает по принципу взаимопомощи: администраторы, готовые выйти дополнительно,
                    объединяются в единую группу. Так филиалы не остаются без сотрудников, а администраторы
                    получают шанс увеличить занятость и доход.
                </p>

                <p>
                    Все процессы — от подачи заявки до выхода на смену — регулируются регламентом ниже.
                    Он описывает порядок взаимодействия, обязанности сторон и меры ответственности.
                </p>

                <b-link label="Перейти в канал" href="https://t.me/britva_search"/>
            </div>
        </portal-card>

        <portal-card title="Координаторы группы">
            <div class="content">
                <ul>
					<li>Смелянский Владислав - +7 (985) 795-55-25</li>
					<li>Вискушенко Георгий - +7 (977) 489-58-99</li>
                </ul>
            </div>
        </portal-card>

        <portal-card title="1. Общие положения">
            <div class="content">
                <p>
                    1.1. Настоящий регламент определяет порядок работы группы подменных администраторов,
                    созданной для оперативного закрытия вакантных смен в графиках постоянных администраторов
                    филиалов сети.
                </p>

                <p>
                    1.2. В группу включаются администраторы, которые:
                </p>

                <ul>
                    <li>имеют недостаточное количество основных смен в своём филиале</li>
                    <li>изъявили добровольное желание участвовать в подменах</li>
                    <li>знакомы и согласны с условиями настоящего регламента</li>
                </ul>

                <p>
                    1.3. Координацию работы группы осуществляют ответственные лица (контакты выше).
                </p>
            </div>
        </portal-card>

        <portal-card title="2. Порядок поиска и назначения подменного администратора">
            <div class="content">
                <p>
                    2.1. При возникновении потребности в закрытии смены ответственный сотрудник проблемного
                    филиала обращается к Координаторам.
                </p>
                <p>
                    2.2. Координаторы размещают объявление о вакантной смене в группу.
                </p>
                <p>
                    2.3. Администратор, желающий занять вакантную смену, проверяет соответствие условиям:
                </p>

                <ul>
                    <li>отсутствие собственной смены в день подмены</li>
                    <li>предварительное устное согласование выхода с владельцем или управляющим своего филиала</li>
                    <li>готовность прибыть вовремя и выполнить все обязанности в полном объёме</li>
                </ul>

                <p>
                    2.4. После подтверждения администратор сообщает о готовности координатору или в группу.
                </p>
                <p>
                    2.5. Окончательное подтверждение выхода — только после согласования с ответственным лицом
                    принимающего филиала.
                </p>
            </div>
        </portal-card>


        <portal-card title="3. Обязанности подменного администратора">
            <div class="content">
                <ul>
                    <li>своевременно прибыть на рабочее место</li>
                    <li>выполнять обязанности по действующей должностной инструкции</li>
                    <li>соблюдать внутренние правила и стандарты принимающего филиала</li>
                    <li>передать необходимую информацию по итогам смены ответственному лицу</li>
                </ul>
            </div>
        </portal-card>


        <portal-card title="4. Обязанности принимающего филиала">
            <div class="content">
                <p><b>Информационное обеспечение:</b> предоставить график работы, контакты ответственных лиц, информацию о совместном открытии/закрытии (при необходимости), особенности филиала.</p>
                <p><b>Расчёт:</b> выплатить заработную плату за смену в день работы (либо в сроки, установленные ТК РФ, но не позднее даты основной выплаты в филиале).</p>
                <p><b>Обратная связь:</b> заполнить форму — <b-link label="ссылка на форму." href="https://forms.yandex.ru/cloud/68bff1a984227c1371ca3954"/>.</p>
                <p><b>Соблюдение правил найма:</b> запрещён прямой хантинг сотрудников других филиалов без согласования с Координаторами и руководством (кроме сотрудников без постоянного филиала).</p>
            </div>
        </portal-card>

        <portal-card title="5. Санкции за нарушение регламента	">
            <div class="content">
                <p>
                    Для подменного администратора:
                </p>
                <ul>
                    <li>неявка без уважительной причины и предупреждения — дисциплинарное взыскание</li>
                    <li>повторная неявка в течение 3 месяцев — исключение из группы на 6 месяцев.</li>
                </ul>
                <p>
                    Для филиала:
                </p>
                <ul>
                    <li>подтверждённый факт переманивания в обход правил — штраф 50 000 ₽.</li>
                </ul>
            </div>
        </portal-card>
    </portal-page>
</template>

<style scoped lang="scss">
.search-staff-view {
	.employees {
        display: flex;
        gap: $indent-x2;
        margin-bottom: $indent-x2;

        :deep(.b-image) {
            img {
                object-fit: cover;
                object-position: top;
            }
        }
    }

    .content {
        @include text-content;
    }
}
</style>