import type { FinesData } from "@v/portal/documents/_soda/fines/definitions/fines"

export const finesData: FinesData[] = [
    {
        header:  "Несогласованная рассылка (Push, SMS, WhatsApp) на клиентскую базу",
        price:   20000,
        content: "Согласовать рассылку можно с отделом сопровождения, контакты ищете на странице сотрудников ЦО.",
    },
    {
        header: "Хантинг администраторов/мастеров",
        price:  50000,
        content:
            [
                "Намеренное переманивание сотрудника на более высокий процент/ставку и т.д. Считается нарушением внутрисетевых партнерских отношений. Также нарушением считается прием на работу сотрудника другого филиала по его желанию без ведома владельца филиала, в котором сотрудник на данный момент работает. Если кандидат не уведомил работодателя о своих намерениях перевестись в любую из сод, данное действие считается основанием занести сотрудника в ЧС SODA. Спорные ситуации решаются в четырехстороннем порядке с участием спорящих филиалов, спорного сотрудника и представителей ЦО.",
                "Пример: кандидат захотел перейти из филиала Сода Скандинавия в филиал Сода Говорово. Владелец филиала Говорово должен предупредить владельца Сода Скандинавия о том, что сотрудник Сода Скандинавия хочет работать в Сода Говорово.",
                "Пример: Владелец филиала Люберцы переманивает администратора Жулебино предлагая ему повышенный процент и выход (ВАЖНО выше чем по внутрисетевому регламенту) не ставя в известность владельца филиала Жулебино.",
                "Если кандидат не уведомил работодателя о своих намерениях перевестись в любую из сод, данное действие считается основанием занести сотрудника в ЧС SODA",
                "Считаем подобного рода случаи вопиющим нарушением внутрисетевой этики и партнерских отношений. Спорные ситуации, связанные с переходом сотрудника из одного филиала в другой решаются в четырех стороннем порядке с участием спорящих филиалов, спорного сотрудника и представителей ЦО.",
            ],
    },
    {
        header:  "Несогласованное принятие сотрудника на работу из ЧС",
        price:   50000,
        content: "Выставление сотрудника в график Yclietns считается принятием сотрудника на работу.",
    },
    {
        header:  "Несогласованное поднятие сотрудника в градации",
        price:   50000,
        content: "Поднятие в градации «топ-мастер маникюра», «бренд-мастер маникюра», «топ-стилист», «топ-бровист» и т.д. Считается нарушением, если сотрудник не прошёл экзамен (обучение). Исключением является индивидуальное согласование, одобренное ЦО (заявка подаётся на этом портале в разделе заявки).",
    },
    {
        header:  "Отсутствие видеоотчета",
        price:   5000,
        content: "Штраф за отсутствие обязательного видеоотчета.",
    },
    {
        header:  "Прием на работу несовершеннолетних сотрудников",
        price:   20000,
        content: "Запрещается брать на работу несовершеннолетних сотрудников. Разрешается брать сотрудников строго с 18 лет.",
    },
    {
        header:  "Непройденный манго аудит",
        price:   5000,
        content: "Манго аудит проходит каждый месяц, подробнее в разделе балльная система по манго аудиту.",
    },
    {
        header:  "Нарушение регламента по оплате труда",
        price:   20000,
        content: "Размер повышенного выхода не может быть выше 7000 рублей, но по истечению 3х месяцев работы сотрудника, не больше 4000 рублей. Минимальный гарантируемый выход у мастера маникюра 4000 рублей, не может быть ниже.",
    },
    {
        header:  "Нарушение стандартов оказания услуг клиенту",
        price:   30000,
        content: "(Оказание услуг вне рабочего места/выездная услуга).",
    },
].map((item, index) => ({
    id: index + 1,
    ...item,
}))
