import type { FinesAuditData } from "@v/portal/documents/_soda/fines-audit/definitions/fines-audit"

export const finesAuditData: FinesAuditData[] = [
    {
        header:  "Инструменты и оборудование",
        content: [
            { text: "Грязный инструмент (стилист/мастер маникюра/бровист)", price: 2000, point: "за единицу" },
            { text: "Грязный воскоплав/парафин", price: 2000 },
            { text: "Неисправный инструмент технически и эстетически(стилисты/бровисты/мастера маникюра)", price: 1000, point: "за единицу" },
            { text: "Отсутствие и неправильное ведение журналов учета стерилизации (сухожар)", price: 5000 },
        ],
    },
    {
        header:  "Чистота и состояние рабочих зон",
        content: [
            { text: "Грязное кресло (в том числе подставка под ноги)", price: 1500, point: "за единицу" },
            { text: "Грязное зеркало заднего вида", price: 700 },
            { text: "Грязное зеркало рабочее", price: 1000, point: "за единицу" },
            { text: "Грязная рабочая полка с косметикой (у стилиста/бровиста/мастеров маникюра)", price: 500, point: "за единицу" },
            { text: "Грязная мойка", price: 700, point: "за единицу" },
            { text: "Присутствие посторонних предметов на рабочем месте (деньги, телефон, наушники и тд)", price: 1000, point: "за единицу" },
            { text: "Нерабочие лампы над рабочими местами", price: 1000, point: "за единицу" },
            { text: "Грязная подсобка (грязная посуда, грязный холодильник, грязная микроволновая печь, грязный стол, неприятный запах)", price: 1500 },
            { text: "Пыль на товарных полках", price: 1000 },
            { text: "Пыль на стойке администратора", price: 1000 },
            { text: "Пыль на ноутбуке", price: 1000 },
            { text: "Пыль на онлайн-кассе/эквайринге", price: 1000 },
            { text: "Пыль на лампах над ресепшн", price: 1000 },
        ],
    },
    {
        header:  "Косметика и расходные материалы",
        content: [
            { text: "Грязные банки с рабочей косметикой на полках (у стилиста/бровиста/гель-лаки/баночки с жидкостями у мастеров маникюра)", price: 500, point: "за единицу" },
            { text: "Грязные шампуни/кондиционеры на мойке стилиста", price: 500, point: "за единицу" },
            { text: "Не накрученные полотенца по стандарту сети", price: 1000 },
            { text: "Косметика несогласованная с ЦО", price: 10000 },
            { text: "Косметика расставлена не по стандартам сети", price: 500, point: "за единицу" },
            { text: "Отсутствие ватных дисков/палочек", price: 500 },
        ],
    },
    {
        header:  "Внешний вид и дисциплина",
        content: [
            { text: "Несоответствие формы сотрудника(админы/стилисты/бровисты/мастера маникюра)", price: 1000, point: "за единицу" },
            { text: "Грязный пеньюар/фартуки и находящийся в не надлежащем состоянии", price: 500, point: "за единицу" },
            { text: "Отсутствие сменной обуви у персонала", price: 500, point: "за пару" },
            { text: "Несоблюдение правил личной гигиены (запах изо рта, запах пота, сальные волосы, нестриженые ногти)", price: 1000 },
            { text: "Пользование наушниками на рабочем месте", price: 1000 },
        ],
    },
    {
        header:  "Знания и стандарты обслуживания",
        content: [
            { text: "Незнание стандартов оказания услуг по памятке", price: 1000, point: "за единицу" },
            { text: "Незнание услуг предоставляемых салоном", price: 2000 },
            { text: "Незнание цен на услуги", price: 2000 },
            { text: "Незнание таймингов выполнения услуг", price: 1000 },
            { text: "Несоблюдение сплит речевки о стоимости акционных услуг (Happy-hours)", price: 10000 },
            { text: "Отсутствие должностных памяток (администратора, стилиста,бровиста)", price: 5000 },
        ],
    },
    {
        header:  "Помещение, атмосфера и общие стандарты",
        content: [
            { text: "Несогласованное мзыкальное сопровождение (все кроме интернет-радио SODA, ЗвукБизнес)", price: 5000 },
            { text: "Воспроизведение нерегламентированного контента по телевизору", price: 5000 },
            { text: "Отсутствие обязательных партнёрских материалов", price: 5000 },
            { text: "Грязные окна или вывеска", price: 5000 },
            { text: "Несогласованные услуги", price: 10000 },
            { text: "Сломанный неон", price: 10000 },
            { text: "Несогласованные элементы интерьера (лампочки, люстра, картина, мебель, кресла)", price: 5000 },
            { text: "Изношенное состояние филиала (в том числе мебель, оборудование, декор, стены, плинтуса, батареи и тд.)", price: 5000, point: "за один элемент" },
            { text: "Изношенное состояние входной группы (мусорка, порог, дверь)", price: 1000, point: "за одну единицу" },
            { text: "Нерабочая вывеска SODA (одна буква или несколько)", price: 10000 },
        ],
    },
].map((item, index) => ({
    id: index + 1,
    ...item,
}))
